{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v3.3.0", "signature": {"inputs": {"X:0": {"name": "X:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}, "outputs": {"accuracy_calc/prediction:0": {"name": "accuracy_calc/prediction:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}}, "modelTopology": {"node": [{"name": "X", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "hidden_1/w1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}}}, {"name": "hidden_1/b1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "hidden_2/w2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "hidden_2/b2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "output_layer/w3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "output_layer/b3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/prediction/dimension", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "hidden_1/MatMul", "op": "MatMul", "input": ["X", "hidden_1/w1"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "hidden_1/add", "op": "AddV2", "input": ["hidden_1/MatMul", "hidden_1/b1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "hidden_1/Relu", "op": "Relu", "input": ["hidden_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "hidden_2/MatMul", "op": "MatMul", "input": ["hidden_1/Relu", "hidden_2/w2"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "hidden_2/add", "op": "AddV2", "input": ["hidden_2/MatMul", "hidden_2/b2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "hidden_2/Relu", "op": "Relu", "input": ["hidden_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output_layer/MatMul", "op": "MatMul", "input": ["hidden_2/Relu", "output_layer/w3"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "output_layer/add", "op": "AddV2", "input": ["output_layer/MatMul", "output_layer/b3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output_layer/Relu", "op": "Relu", "input": ["output_layer/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/prediction", "op": "ArgMax", "input": ["output_layer/Relu", "accuracy_calc/prediction/dimension"], "attr": {"output_type": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 561}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "hidden_1/w1", "shape": [784, 512], "dtype": "float32"}, {"name": "hidden_1/b1", "shape": [512], "dtype": "float32"}, {"name": "hidden_2/w2", "shape": [512, 64], "dtype": "float32"}, {"name": "hidden_2/b2", "shape": [64], "dtype": "float32"}, {"name": "output_layer/w3", "shape": [64, 10], "dtype": "float32"}, {"name": "output_layer/b3", "shape": [10], "dtype": "float32"}, {"name": "accuracy_calc/prediction/dimension", "shape": [], "dtype": "int32"}]}]}